angular.module('xw.services').constant('Address', [
    {
        "Name": "天津",
        "City": [
            {
                "Name": "天津",
                "Region": [
                    {
                        "Name": "和平"
                    },
                    {
                        "Name": "东丽"
                    },
                    {
                        "Name": "西青"
                    },
                    {
                        "Name": "津南"
                    },
                    {
                        "Name": "北辰"
                    },
                    {
                        "Name": "河东"
                    },
                    {
                        "Name": "宁河"
                    },
                    {
                        "Name": "武清"
                    },
                    {
                        "Name": "静海"
                    },
                    {
                        "Name": "宝坻"
                    },
                    {
                        "Name": "蓟县"
                    },
                    {
                        "Name": "河西"
                    },
                    {
                        "Name": "南开"
                    },
                    {
                        "Name": "河北"
                    },
                    {
                        "Name": "红桥"
                    },
                    {
                        "Name": "滨海新区"
                    }
                ]
            }
        ]
    },
    {
        "Name": "辽宁",
        "City": [
            {
                "Name": "大连",
                "Region": [
                    {
                        "Name": "中山区"
                    },
                    {
                        "Name": "西岗区"
                    },
                    {
                        "Name": "沙河口区"
                    },
                    {
                        "Name": "甘井子区"
                    },
                    {
                        "Name": "旅顺口区"
                    },
                    {
                        "Name": "金州区"
                    },
                    {
                        "Name": "长海县"
                    },
                    {
                        "Name": "瓦房店市"
                    },
                    {
                        "Name": "普兰店市"
                    },
                    {
                        "Name": "庄河市"
                    }
                ]
            }
        ]
    },
    {
        "Name": "上海",
        "City": [
            {
                "Name": "上海",
                "Region": [
                    {
                        "Name": "黄浦"
                    },
                    {
                        "Name": "杨浦"
                    },
                    {
                        "Name": "闵行"
                    },
                    {
                        "Name": "宝山"
                    },
                    {
                        "Name": "嘉定"
                    },
                    {
                        "Name": "浦东新区"
                    },
                    {
                        "Name": "金山"
                    },
                    {
                        "Name": "松江"
                    },
                    {
                        "Name": "奉贤"
                    },
                    {
                        "Name": "青浦"
                    },
                    {
                        "Name": "卢湾"
                    },
                    {
                        "Name": "徐汇"
                    },
                    {
                        "Name": "长宁"
                    },
                    {
                        "Name": "静安"
                    },
                    {
                        "Name": "普陀"
                    },
                    {
                        "Name": "闸北"
                    },
                    {
                        "Name": "虹口"
                    }
                ]
            }
        ]
    },
    {
        "Name": "江苏",
        "City": [
            {
                "Name": "南京",
                "Region": [
                    {
                        "Name": "玄武区"
                    },
                    {
                        "Name": "白下区"
                    },
                    {
                        "Name": "秦淮区"
                    },
                    {
                        "Name": "建邺区"
                    },
                    {
                        "Name": "鼓楼区"
                    },
                    {
                        "Name": "下关区"
                    },
                    {
                        "Name": "浦口区"
                    },
                    {
                        "Name": "栖霞区"
                    },
                    {
                        "Name": "雨花台区"
                    },
                    {
                        "Name": "江宁区"
                    },
                    {
                        "Name": "六合区"
                    },
                    {
                        "Name": "溧水县"
                    },
                    {
                        "Name": "高淳县"
                    }
                ]
            },
            {
                "Name": "扬州",
                "Region": [
                    {
                        "Name": "广陵区"
                    },
                    {
                        "Name": "邗江区"
                    },
                    {
                        "Name": "维扬区"
                    },
                    {
                        "Name": "宝应县"
                    },
                    {
                        "Name": "仪征市"
                    },
                    {
                        "Name": "高邮市"
                    },
                    {
                        "Name": "江都市"
                    }
                ]
            },
            {
                "Name": "镇江",
                "Region": [
                    {
                        "Name": "京口区"
                    },
                    {
                        "Name": "润州区"
                    },
                    {
                        "Name": "丹徒区"
                    },
                    {
                        "Name": "丹阳市"
                    },
                    {
                        "Name": "扬中市"
                    },
                    {
                        "Name": "句容市"
                    }
                ]
            },
            {
                "Name": "泰州",
                "Region": [
                    {
                        "Name": "海陵区"
                    },
                    {
                        "Name": "高港区"
                    },
                    {
                        "Name": "兴化市"
                    },
                    {
                        "Name": "靖江市"
                    },
                    {
                        "Name": "泰兴市"
                    },
                    {
                        "Name": "姜堰市"
                    }
                ]
            },
            {
                "Name": "宿迁",
                "Region": [
                    {
                        "Name": "宿城区"
                    },
                    {
                        "Name": "宿豫区"
                    },
                    {
                        "Name": "沭阳县"
                    },
                    {
                        "Name": "泗阳县"
                    },
                    {
                        "Name": "泗洪县"
                    }
                ]
            },
            {
                "Name": "无锡",
                "Region": [
                    {
                        "Name": "崇安区"
                    },
                    {
                        "Name": "南长区"
                    },
                    {
                        "Name": "北塘区"
                    },
                    {
                        "Name": "锡山区"
                    },
                    {
                        "Name": "惠山区"
                    },
                    {
                        "Name": "滨湖区"
                    },
                    {
                        "Name": "江阴市"
                    },
                    {
                        "Name": "宜兴市"
                    }
                ]
            },
            {
                "Name": "徐州",
                "Region": [
                    {
                        "Name": "鼓楼区"
                    },
                    {
                        "Name": "云龙区"
                    },
                    {
                        "Name": "九里区"
                    },
                    {
                        "Name": "贾汪区"
                    },
                    {
                        "Name": "泉山区"
                    },
                    {
                        "Name": "丰县"
                    },
                    {
                        "Name": "沛县"
                    },
                    {
                        "Name": "铜山县"
                    },
                    {
                        "Name": "睢宁县"
                    },
                    {
                        "Name": "新沂市"
                    },
                    {
                        "Name": "邳州市"
                    }
                ]
            },
            {
                "Name": "常州",
                "Region": [
                    {
                        "Name": "天宁区"
                    },
                    {
                        "Name": "钟楼区"
                    },
                    {
                        "Name": "戚墅堰区"
                    },
                    {
                        "Name": "新北区"
                    },
                    {
                        "Name": "武进区"
                    },
                    {
                        "Name": "溧阳市"
                    },
                    {
                        "Name": "金坛市"
                    }
                ]
            },
            {
                "Name": "苏州",
                "Region": [
                    {
                        "Name": "沧浪区"
                    },
                    {
                        "Name": "平江区"
                    },
                    {
                        "Name": "金阊区"
                    },
                    {
                        "Name": "虎丘区"
                    },
                    {
                        "Name": "吴中区"
                    },
                    {
                        "Name": "相城区"
                    },
                    {
                        "Name": "常熟市"
                    },
                    {
                        "Name": "张家港市"
                    },
                    {
                        "Name": "昆山市"
                    },
                    {
                        "Name": "吴江市"
                    },
                    {
                        "Name": "太仓市"
                    }
                ]
            },
            {
                "Name": "南通",
                "Region": [
                    {
                        "Name": "崇川区"
                    },
                    {
                        "Name": "港闸区"
                    },
                    {
                        "Name": "海安县"
                    },
                    {
                        "Name": "如东县"
                    },
                    {
                        "Name": "启东市"
                    },
                    {
                        "Name": "如皋市"
                    },
                    {
                        "Name": "通州市"
                    },
                    {
                        "Name": "海门市"
                    }
                ]
            },
            {
                "Name": "连云港",
                "Region": [
                    {
                        "Name": "连云区"
                    },
                    {
                        "Name": "新浦区"
                    },
                    {
                        "Name": "海州区"
                    },
                    {
                        "Name": "赣榆县"
                    },
                    {
                        "Name": "东海县"
                    },
                    {
                        "Name": "灌云县"
                    },
                    {
                        "Name": "灌南县"
                    }
                ]
            },
            {
                "Name": "淮安",
                "Region": [
                    {
                        "Name": "清河区"
                    },
                    {
                        "Name": "楚州区"
                    },
                    {
                        "Name": "淮阴区"
                    },
                    {
                        "Name": "清浦区"
                    },
                    {
                        "Name": "涟水县"
                    },
                    {
                        "Name": "洪泽县"
                    },
                    {
                        "Name": "盱眙县"
                    },
                    {
                        "Name": "金湖县"
                    }
                ]
            },
            {
                "Name": "盐城",
                "Region": [
                    {
                        "Name": "亭湖区"
                    },
                    {
                        "Name": "盐都区"
                    },
                    {
                        "Name": "响水县"
                    },
                    {
                        "Name": "滨海县"
                    },
                    {
                        "Name": "阜宁县"
                    },
                    {
                        "Name": "射阳县"
                    },
                    {
                        "Name": "建湖县"
                    },
                    {
                        "Name": "东台市"
                    },
                    {
                        "Name": "大丰市"
                    }
                ]
            }
        ]
    },
    {
        "Name": "浙江",
        "City": [
            {
                "Name": "杭州",
                "Region": [
                    {
                        "Name": "上城区"
                    },
                    {
                        "Name": "下城区"
                    },
                    {
                        "Name": "江干区"
                    },
                    {
                        "Name": "拱墅区"
                    },
                    {
                        "Name": "西湖区"
                    },
                    {
                        "Name": "滨江区"
                    },
                    {
                        "Name": "萧山区"
                    },
                    {
                        "Name": "余杭区"
                    },
                    {
                        "Name": "桐庐县"
                    },
                    {
                        "Name": "淳安县"
                    },
                    {
                        "Name": "建德市"
                    },
                    {
                        "Name": "富阳市"
                    },
                    {
                        "Name": "临安市"
                    }
                ]
            },
            {
                "Name": "台州",
                "Region": [
                    {
                        "Name": "椒江区"
                    },
                    {
                        "Name": "黄岩区"
                    },
                    {
                        "Name": "路桥区"
                    },
                    {
                        "Name": "玉环县"
                    },
                    {
                        "Name": "三门县"
                    },
                    {
                        "Name": "天台县"
                    },
                    {
                        "Name": "仙居县"
                    },
                    {
                        "Name": "温岭市"
                    },
                    {
                        "Name": "临海市"
                    }
                ]
            },
            {
                "Name": "丽水",
                "Region": [
                    {
                        "Name": "莲都区"
                    },
                    {
                        "Name": "青田县"
                    },
                    {
                        "Name": "缙云县"
                    },
                    {
                        "Name": "遂昌县"
                    },
                    {
                        "Name": "松阳县"
                    },
                    {
                        "Name": "云和县"
                    },
                    {
                        "Name": "庆元县"
                    },
                    {
                        "Name": "景宁畲族自治县"
                    },
                    {
                        "Name": "龙泉市"
                    }
                ]
            },
            {
                "Name": "宁波",
                "Region": [
                    {
                        "Name": "海曙区"
                    },
                    {
                        "Name": "江东区"
                    },
                    {
                        "Name": "江北区"
                    },
                    {
                        "Name": "北仑区"
                    },
                    {
                        "Name": "镇海区"
                    },
                    {
                        "Name": "鄞州区"
                    },
                    {
                        "Name": "象山县"
                    },
                    {
                        "Name": "宁海县"
                    },
                    {
                        "Name": "余姚市"
                    },
                    {
                        "Name": "慈溪市"
                    },
                    {
                        "Name": "奉化市"
                    }
                ]
            },
            {
                "Name": "温州",
                "Region": [
                    {
                        "Name": "鹿城区"
                    },
                    {
                        "Name": "龙湾区"
                    },
                    {
                        "Name": "瓯海区"
                    },
                    {
                        "Name": "洞头县"
                    },
                    {
                        "Name": "永嘉县"
                    },
                    {
                        "Name": "平阳县"
                    },
                    {
                        "Name": "苍南县"
                    },
                    {
                        "Name": "文成县"
                    },
                    {
                        "Name": "泰顺县"
                    },
                    {
                        "Name": "瑞安市"
                    },
                    {
                        "Name": "乐清市"
                    }
                ]
            },
            {
                "Name": "嘉兴",
                "Region": [
                    {
                        "Name": "南湖区"
                    },
                    {
                        "Name": "秀洲区"
                    },
                    {
                        "Name": "嘉善县"
                    },
                    {
                        "Name": "海盐县"
                    },
                    {
                        "Name": "海宁市"
                    },
                    {
                        "Name": "平湖市"
                    },
                    {
                        "Name": "桐乡市"
                    }
                ]
            },
            {
                "Name": "湖州",
                "Region": [
                    {
                        "Name": "吴兴区"
                    },
                    {
                        "Name": "南浔区"
                    },
                    {
                        "Name": "德清县"
                    },
                    {
                        "Name": "长兴县"
                    },
                    {
                        "Name": "安吉县"
                    }
                ]
            },
            {
                "Name": "绍兴",
                "Region": [
                    {
                        "Name": "越城区"
                    },
                    {
                        "Name": "绍兴县"
                    },
                    {
                        "Name": "新昌县"
                    },
                    {
                        "Name": "诸暨市"
                    },
                    {
                        "Name": "上虞市"
                    },
                    {
                        "Name": "嵊州市"
                    }
                ]
            },
            {
                "Name": "金华",
                "Region": [
                    {
                        "Name": "婺城区"
                    },
                    {
                        "Name": "金东区"
                    },
                    {
                        "Name": "武义县"
                    },
                    {
                        "Name": "浦江县"
                    },
                    {
                        "Name": "磐安县"
                    },
                    {
                        "Name": "兰溪市"
                    },
                    {
                        "Name": "义乌市"
                    },
                    {
                        "Name": "东阳市"
                    },
                    {
                        "Name": "永康市"
                    }
                ]
            },
            {
                "Name": "衢州",
                "Region": [
                    {
                        "Name": "柯城区"
                    },
                    {
                        "Name": "衢江区"
                    },
                    {
                        "Name": "常山县"
                    },
                    {
                        "Name": "开化县"
                    },
                    {
                        "Name": "龙游县"
                    },
                    {
                        "Name": "江山市"
                    }
                ]
            },
            {
                "Name": "舟山",
                "Region": [
                    {
                        "Name": "定海区"
                    },
                    {
                        "Name": "普陀区"
                    },
                    {
                        "Name": "岱山县"
                    },
                    {
                        "Name": "嵊泗县"
                    }
                ]
            }
        ]
    },
    {
        "Name": "安徽",
        "City": [
            {
                "Name": "合肥",
                "Region": [
                    {
                        "Name": "瑶海区"
                    },
                    {
                        "Name": "庐阳区"
                    },
                    {
                        "Name": "蜀山区"
                    },
                    {
                        "Name": "包河区"
                    },
                    {
                        "Name": "长丰县"
                    },
                    {
                        "Name": "肥东县"
                    },
                    {
                        "Name": "肥西县"
                    }
                ]
            },
            {
                "Name": "黄山",
                "Region": [
                    {
                        "Name": "屯溪区"
                    },
                    {
                        "Name": "黄山区"
                    },
                    {
                        "Name": "徽州区"
                    },
                    {
                        "Name": "歙县"
                    },
                    {
                        "Name": "休宁县"
                    },
                    {
                        "Name": "黟县"
                    },
                    {
                        "Name": "祁门县"
                    }
                ]
            },
            {
                "Name": "滁州",
                "Region": [
                    {
                        "Name": "琅琊区"
                    },
                    {
                        "Name": "南谯区"
                    },
                    {
                        "Name": "来安县"
                    },
                    {
                        "Name": "全椒县"
                    },
                    {
                        "Name": "定远县"
                    },
                    {
                        "Name": "凤阳县"
                    },
                    {
                        "Name": "天长市"
                    },
                    {
                        "Name": "明光市"
                    }
                ]
            },
            {
                "Name": "阜阳",
                "Region": [
                    {
                        "Name": "颍州区"
                    },
                    {
                        "Name": "颍东区"
                    },
                    {
                        "Name": "颍泉区"
                    },
                    {
                        "Name": "临泉县"
                    },
                    {
                        "Name": "太和县"
                    },
                    {
                        "Name": "阜南县"
                    },
                    {
                        "Name": "颍上县"
                    },
                    {
                        "Name": "界首市"
                    }
                ]
            },
            {
                "Name": "宿州",
                "Region": [
                    {
                        "Name": "埇桥区"
                    },
                    {
                        "Name": "砀山县"
                    },
                    {
                        "Name": "萧县"
                    },
                    {
                        "Name": "灵璧县"
                    },
                    {
                        "Name": "泗县"
                    }
                ]
            },
            {
                "Name": "巢湖",
                "Region": [
                    {
                        "Name": "居巢区"
                    },
                    {
                        "Name": "庐江县"
                    },
                    {
                        "Name": "无为县"
                    },
                    {
                        "Name": "含山县"
                    },
                    {
                        "Name": "和县"
                    }
                ]
            },
            {
                "Name": "六安",
                "Region": [
                    {
                        "Name": "金安区"
                    },
                    {
                        "Name": "裕安区"
                    },
                    {
                        "Name": "寿县"
                    },
                    {
                        "Name": "霍邱县"
                    },
                    {
                        "Name": "舒城县"
                    },
                    {
                        "Name": "金寨县"
                    },
                    {
                        "Name": "霍山县"
                    }
                ]
            },
            {
                "Name": "亳州",
                "Region": [
                    {
                        "Name": "谯城区"
                    },
                    {
                        "Name": "涡阳县"
                    },
                    {
                        "Name": "蒙城县"
                    },
                    {
                        "Name": "利辛县"
                    }
                ]
            },
            {
                "Name": "池州",
                "Region": [
                    {
                        "Name": "贵池区"
                    },
                    {
                        "Name": "东至县"
                    },
                    {
                        "Name": "石台县"
                    },
                    {
                        "Name": "青阳县"
                    }
                ]
            },
            {
                "Name": "宣城",
                "Region": [
                    {
                        "Name": "宣州区"
                    },
                    {
                        "Name": "郎溪县"
                    },
                    {
                        "Name": "广德县"
                    },
                    {
                        "Name": "泾县"
                    },
                    {
                        "Name": "绩溪县"
                    },
                    {
                        "Name": "旌德县"
                    },
                    {
                        "Name": "宁国市"
                    }
                ]
            },
            {
                "Name": "芜湖",
                "Region": [
                    {
                        "Name": "镜湖区"
                    },
                    {
                        "Name": "弋江区"
                    },
                    {
                        "Name": "鸠江区"
                    },
                    {
                        "Name": "三山区"
                    },
                    {
                        "Name": "芜湖县"
                    },
                    {
                        "Name": "繁昌县"
                    },
                    {
                        "Name": "南陵县"
                    }
                ]
            },
            {
                "Name": "蚌埠",
                "Region": [
                    {
                        "Name": "龙子湖区"
                    },
                    {
                        "Name": "蚌山区"
                    },
                    {
                        "Name": "禹会区"
                    },
                    {
                        "Name": "淮上区"
                    },
                    {
                        "Name": "怀远县"
                    },
                    {
                        "Name": "五河县"
                    },
                    {
                        "Name": "固镇县"
                    }
                ]
            },
            {
                "Name": "淮南",
                "Region": [
                    {
                        "Name": "大通区"
                    },
                    {
                        "Name": "田家庵区"
                    },
                    {
                        "Name": "谢家集区"
                    },
                    {
                        "Name": "八公山区"
                    },
                    {
                        "Name": "潘集区"
                    },
                    {
                        "Name": "凤台县"
                    }
                ]
            },
            {
                "Name": "马鞍山",
                "Region": [
                    {
                        "Name": "金家庄区"
                    },
                    {
                        "Name": "花山区"
                    },
                    {
                        "Name": "雨山区"
                    },
                    {
                        "Name": "当涂县"
                    }
                ]
            },
            {
                "Name": "淮北",
                "Region": [
                    {
                        "Name": "杜集区"
                    },
                    {
                        "Name": "相山区"
                    },
                    {
                        "Name": "烈山区"
                    },
                    {
                        "Name": "濉溪县"
                    }
                ]
            },
            {
                "Name": "铜陵",
                "Region": [
                    {
                        "Name": "铜官山区"
                    },
                    {
                        "Name": "狮子山区"
                    },
                    {
                        "Name": "郊区"
                    },
                    {
                        "Name": "铜陵县"
                    }
                ]
            },
            {
                "Name": "安庆",
                "Region": [
                    {
                        "Name": "迎江区"
                    },
                    {
                        "Name": "大观区"
                    },
                    {
                        "Name": "宜秀区"
                    },
                    {
                        "Name": "怀宁县"
                    },
                    {
                        "Name": "枞阳县"
                    },
                    {
                        "Name": "潜山县"
                    },
                    {
                        "Name": "太湖县"
                    },
                    {
                        "Name": "宿松县"
                    },
                    {
                        "Name": "望江县"
                    },
                    {
                        "Name": "岳西县"
                    },
                    {
                        "Name": "桐城市"
                    }
                ]
            }
        ]
    },
    {
        "Name": "福建",
        "City": [
            {
                "Name": "福州",
                "Region": [
                    {
                        "Name": "鼓楼区"
                    },
                    {
                        "Name": "台江区"
                    },
                    {
                        "Name": "仓山区"
                    },
                    {
                        "Name": "马尾区"
                    },
                    {
                        "Name": "晋安区"
                    },
                    {
                        "Name": "闽侯县"
                    },
                    {
                        "Name": "连江县"
                    },
                    {
                        "Name": "罗源县"
                    },
                    {
                        "Name": "闽清县"
                    },
                    {
                        "Name": "永泰县"
                    },
                    {
                        "Name": "平潭县"
                    },
                    {
                        "Name": "福清市"
                    },
                    {
                        "Name": "长乐市"
                    }
                ]
            },
            {
                "Name": "厦门",
                "Region": [
                    {
                        "Name": "思明区"
                    },
                    {
                        "Name": "海沧区"
                    },
                    {
                        "Name": "湖里区"
                    },
                    {
                        "Name": "集美区"
                    },
                    {
                        "Name": "同安区"
                    },
                    {
                        "Name": "翔安区"
                    }
                ]
            }
        ]
    },
    {
        "Name": "山东",
        "City": [
            {
                "Name": "济南",
                "Region": [
                    {
                        "Name": "历下区"
                    },
                    {
                        "Name": "市中区"
                    },
                    {
                        "Name": "槐荫区"
                    },
                    {
                        "Name": "天桥区"
                    },
                    {
                        "Name": "历城区"
                    },
                    {
                        "Name": "长清区"
                    },
                    {
                        "Name": "平阴县"
                    },
                    {
                        "Name": "济阳县"
                    },
                    {
                        "Name": "商河县"
                    },
                    {
                        "Name": "章丘市"
                    }
                ]
            },
            {
                "Name": "青岛",
                "Region": [
                    {
                        "Name": "市南区"
                    },
                    {
                        "Name": "市北区"
                    },
                    {
                        "Name": "四方区"
                    },
                    {
                        "Name": "黄岛区"
                    },
                    {
                        "Name": "崂山区"
                    },
                    {
                        "Name": "李沧区"
                    },
                    {
                        "Name": "城阳区"
                    },
                    {
                        "Name": "胶州市"
                    },
                    {
                        "Name": "即墨市"
                    },
                    {
                        "Name": "平度市"
                    },
                    {
                        "Name": "胶南市"
                    },
                    {
                        "Name": "莱西市"
                    }
                ]
            }
        ]
    },
    {
        "Name": "湖北",
        "City": [
            {
                "Name": "武汉",
                "Region": [
                    {
                        "Name": "江岸区"
                    },
                    {
                        "Name": "江汉区"
                    },
                    {
                        "Name": "硚口区"
                    },
                    {
                        "Name": "汉阳区"
                    },
                    {
                        "Name": "武昌区"
                    },
                    {
                        "Name": "青山区"
                    },
                    {
                        "Name": "洪山区"
                    },
                    {
                        "Name": "东西湖区"
                    },
                    {
                        "Name": "汉南区"
                    },
                    {
                        "Name": "蔡甸区"
                    },
                    {
                        "Name": "江夏区"
                    },
                    {
                        "Name": "黄陂区"
                    },
                    {
                        "Name": "新洲区"
                    }
                ]
            }
        ]
    },
    {
        "Name": "广东",
        "City": [
            {
                "Name": "广州",
                "Region": [
                    {
                        "Name": "荔湾区"
                    },
                    {
                        "Name": "越秀区"
                    },
                    {
                        "Name": "海珠区"
                    },
                    {
                        "Name": "天河区"
                    },
                    {
                        "Name": "白云区"
                    },
                    {
                        "Name": "黄埔区"
                    },
                    {
                        "Name": "番禺区"
                    },
                    {
                        "Name": "花都区"
                    },
                    {
                        "Name": "南沙区"
                    },
                    {
                        "Name": "萝岗区"
                    },
                    {
                        "Name": "增城市"
                    },
                    {
                        "Name": "从化市"
                    }
                ]
            },
            {
                "Name": "东莞",
                "Region": [{
                    "Name": "东莞市"
                }]
            },
            {
                "Name": "深圳",
                "Region": [
                    {
                        "Name": "罗湖区"
                    },
                    {
                        "Name": "福田区"
                    },
                    {
                        "Name": "南山区"
                    },
                    {
                        "Name": "宝安区"
                    },
                    {
                        "Name": "龙岗区"
                    },
                    {
                        "Name": "盐田区"
                    }
                ]
            },
            {
                "Name": "珠海",
                "Region": [
                    {
                        "Name": "香洲区"
                    },
                    {
                        "Name": "斗门区"
                    },
                    {
                        "Name": "金湾区"
                    }
                ]
            },
            {
                "Name": "汕头",
                "Region": [
                    {
                        "Name": "龙湖区"
                    },
                    {
                        "Name": "金平区"
                    },
                    {
                        "Name": "濠江区"
                    },
                    {
                        "Name": "潮阳区"
                    },
                    {
                        "Name": "潮南区"
                    },
                    {
                        "Name": "澄海区"
                    },
                    {
                        "Name": "南澳县"
                    }
                ]
            },
            {
                "Name": "佛山",
                "Region": [
                    {
                        "Name": "禅城区"
                    },
                    {
                        "Name": "南海区"
                    },
                    {
                        "Name": "顺德区"
                    },
                    {
                        "Name": "三水区"
                    },
                    {
                        "Name": "高明区"
                    }
                ]
            }
        ]
    },
    {
        "Name": "四川",
        "City": [
            {
                "Name": "成都",
                "Region": [
                    {
                        "Name": "锦江区"
                    },
                    {
                        "Name": "青羊区"
                    },
                    {
                        "Name": "金牛区"
                    },
                    {
                        "Name": "武侯区"
                    },
                    {
                        "Name": "成华区"
                    },
                    {
                        "Name": "龙泉驿区"
                    },
                    {
                        "Name": "青白江区"
                    },
                    {
                        "Name": "新都区"
                    },
                    {
                        "Name": "温江区"
                    },
                    {
                        "Name": "金堂县"
                    },
                    {
                        "Name": "双流县"
                    },
                    {
                        "Name": "郫县"
                    },
                    {
                        "Name": "大邑县"
                    },
                    {
                        "Name": "蒲江县"
                    },
                    {
                        "Name": "新津县"
                    },
                    {
                        "Name": "都江堰市"
                    },
                    {
                        "Name": "彭州市"
                    },
                    {
                        "Name": "邛崃市"
                    },
                    {
                        "Name": "崇州市"
                    }
                ]
            }
        ]
    }
]);